Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/iLLD/TC3xx/Tricore/_Impl/IfxMtu_cfg_TC33x.c
/**
 * \file IfxMtu_cfg_TC33x.c
 * \brief Mtu on-chip implementation data
 *
 * \version iLLD_1_20_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 */

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/
#include "Ifx_Cfg.h"
#if defined (__TASKING__)
#pragma warning 508		/* To suppress empty file warning */
#endif
#if defined (__ghs__)
#pragma diag_suppress 96		/* To suppress empty file warning */
#endif
#if defined DEVICE_TC33X

#include "IfxMtu_cfg_TC33x.h" 
#include "Mtu/Std/IfxMtu.h"

/******************************************************************************/
/*-----------------------Exported Variables/Constants-------------------------*/
/******************************************************************************/

const IfxMtu_SramItem           IfxMtu_sramTable[IFXMTU_NUM_MBIST_TABLE_ITEMS] = {
    {2 * 4, 16,  6,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu0Dspr0 */
    {2 * 1, 19,  10, 0, 4}, /**< \brief IfxMtu_MbistSel_cpu0Dtag */
    {2 * 2, 64,  8,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu0Pspr */
    {2 * 1, 19,  10, 0, 4}, /**< \brief IfxMtu_MbistSel_cpu0Ptag */
    {2 * 1, 64,  8,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu0Dlmu */   
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {2 * 4, 16,  6,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu1Dspr1 */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 4, 64,  8,  0, 1}, /**< \brief IfxMtu_MbistSel_dma */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 1, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_mcan0 */
    {1 * 1, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_mcan1 */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 2, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_eray0Obf */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 4, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_eray0IbfTbf */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 1, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_eray0Mbf */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {2 * 2, 8,   5,  0, 1}, /**< \brief IfxMtu_MbistSel_scrXram */
    {1 * 1, 8,   5,  0, 1}, /**< \brief IfxMtu_MbistSel_scrIram */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,  0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
};

const IfxMtu_MbistConfigPattern nonDestructiveTestPattern[] = {
    {
        IFXMTU_MBIST_CONFIG_NONDISTTEST_CONFIG0,
        IFXMTU_MBIST_CONFIG_NONDISTTEST_CONFIG1
    }
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang0[] = {
    {
        IfxMtu_MbistSel_mcan0,                                  /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x7F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        1                                                       /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_mcan1,                                  /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x3F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        1                                                       /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu0Dspr,                               /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x7F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        0                                                       /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu0Dlmu,                               /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x3F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        0                                                       /* preClearEnable  */
    },
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang4[] = {
    {
        IfxMtu_MbistSel_cpu0Pspr,                                /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x2F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        0                                                        /* preClearEnable  */
    },
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang6[] = {
    {
        IfxMtu_MbistSel_cpu0Ptag,                               /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x7,                                                    /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        0                                                       /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu0Dtag,                               /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x03,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        1                                                       /* preClearEnable  */
    },
};

const IfxMtu_MbistConfig        mbistGang0Config = {
    IFXMTU_MBIST_CONFIG_NONDISTTEST_MCONTROL,                             /* mcontrol        */
    sizeof(mbistSshConfigGang0) / sizeof(IfxMtu_MbistSshConfig),
    sizeof(nonDestructiveTestPattern) / sizeof(IfxMtu_MbistConfigPattern),
    mbistSshConfigGang0,
    nonDestructiveTestPattern
};

const IfxMtu_MbistConfig        mbistGang4Config = {
    IFXMTU_MBIST_CONFIG_NONDISTTEST_MCONTROL,                             /* mcontrol        */
    sizeof(mbistSshConfigGang4) / sizeof(IfxMtu_MbistSshConfig),
    sizeof(nonDestructiveTestPattern) / sizeof(IfxMtu_MbistConfigPattern),
    mbistSshConfigGang4,
    nonDestructiveTestPattern
};

const IfxMtu_MbistConfig        mbistGang6Config = {
    IFXMTU_MBIST_CONFIG_NONDISTTEST_MCONTROL,                             /* mcontrol        */
    sizeof(mbistSshConfigGang6) / sizeof(IfxMtu_MbistSshConfig),
    sizeof(nonDestructiveTestPattern) / sizeof(IfxMtu_MbistConfigPattern),
    mbistSshConfigGang6,
    nonDestructiveTestPattern
};

const IfxMtu_MbistConfig *const mbistGangConfig[] = {
    &mbistGang0Config,
    &mbistGang4Config,
    &mbistGang6Config,
    (void *)0 //End indicator
};
#endif

#if defined (_TASKING_) || defined (_ghs_)
#pragma restore
#endif
